Links de ejemplo:
SQLITE
https://colab.research.google.com/drive/1MtbX8kmRLaQtx4YNZyf9NpMGu_tLxem_#scrollTo=08687a91
MYSQL
https://colab.research.google.com/drive/1n330_zYLZ9oijeH9z9siavUt1awCADG5
SQL SERVER
https://colab.research.google.com/drive/1Z1PjfL_sYrdSOIfqfy5FcbBcC3JXRg8C#scrollTo=307da522
POSTGRES
colab.research.google.com/drive/1Y7wtCTW9n4fYCFEwLd193-hMuPB3s1hK

Tratamiento con Pandas
https://colab.research.google.com/drive/1KEmYVoVjMhuIsVsTzy9_RBItQhc6YmTE

In [1]:
import sqlite3
import pandas as pd
import sqlalchemy as db

In [2]:
conn = sqlite3.connect("basepractica.db")
cursor = conn.cursor()

In [3]:
print(cursor)

<sqlite3.Cursor object at 0x7f0120255180>

In [4]:
query = """CREATE TABLE IF NOT EXISTS orders (
            orderId INTEGER,
            totalPrice REAL,
            address TEXT
            )"""

cursor.execute(query)
conn.commit()

In [9]:
# Insertar datos
order_data = [
    (546, 3489.98, 'Buenos Aires 989'),
    (547, 6897, 'Espronceda 3218'),
    (560, 7542.35, 'Pasteur 1788'),
    (562, 11432, 'Galicia 1252')
]

cursor.executemany("INSERT INTO orders VALUES (?, ?, ?)", order_data)
conn.commit()

In [12]:
# Seleccionar un dato utilizando fetchone
query = "SELECT * FROM orders"
cursor.execute(query)
one_result = cursor.fetchone()
print(one_result)

# Seleccionar varios datos utilizando fetchmany
query = "SELECT * FROM orders"
cursor.execute(query)
many_results = cursor.fetchmany(2)
print(many_results)
# Seleccionar todos los datos utilizando fetchall
query = "SELECT * FROM orders"
cursor.execute(query)
results = cursor.fetchall()
for r in results:
    print(r)

(546, 3489.98, 'Buenos Aires 989')
[(546, 3489.98, 'Buenos Aires 989'), (547, 6897.0, 'Espronceda 3218')]
(546, 3489.98, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(560, 7542.35, 'Pasteur 1788')
(562, 11432.0, 'Galicia 1252')
(546, 3489.98, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(560, 7542.35, 'Pasteur 1788')
(562, 11432.0, 'Galicia 1252')
(546, 3489.98, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(560, 7542.35, 'Pasteur 1788')
(562, 11432.0, 'Galicia 1252')
(546, 3489.98, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(560, 7542.35, 'Pasteur 1788')
(562, 11432.0, 'Galicia 1252')

In [13]:
# Update data
query = """UPDATE orders
            SET totalPrice = 6150.80
            WHERE address = 'Buenos Aires 989'
            
"""
cursor.execute(query)
conn.commit()

# Seleccionar todos los datos utilizando fetchall
query = "SELECT * FROM orders"
cursor.execute(query)
results = cursor.fetchall()
for r in results:
    print(r)

(546, 6150.8, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(560, 7542.35, 'Pasteur 1788')
(562, 11432.0, 'Galicia 1252')
(546, 6150.8, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(560, 7542.35, 'Pasteur 1788')
(562, 11432.0, 'Galicia 1252')
(546, 6150.8, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(560, 7542.35, 'Pasteur 1788')
(562, 11432.0, 'Galicia 1252')
(546, 6150.8, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(560, 7542.35, 'Pasteur 1788')
(562, 11432.0, 'Galicia 1252')

In [14]:
# Borrar datos
query = "DELETE FROM orders WHERE address = 'Pasteur 1788'"
cursor.execute(query)

# Seleccionar todos los datos utilizando fetchall
query = "SELECT * FROM orders"
cursor.execute(query)
results = cursor.fetchall()
for r in results:
    print(r)

(546, 6150.8, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(562, 11432.0, 'Galicia 1252')
(546, 6150.8, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(562, 11432.0, 'Galicia 1252')
(546, 6150.8, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(562, 11432.0, 'Galicia 1252')
(546, 6150.8, 'Buenos Aires 989')
(547, 6897.0, 'Espronceda 3218')
(562, 11432.0, 'Galicia 1252')

In [15]:
# Obtener un dataframe a partir de una consulta SQL
query = "SELECT * FROM orders"
data = pd.read_sql(query, con=conn)
data.head()

   orderId  totalPrice           address
0      546      6150.8  Buenos Aires 989
1      547      6897.0   Espronceda 3218
2      562     11432.0      Galicia 1252
3      546      6150.8  Buenos Aires 989
4      547      6897.0   Espronceda 3218